# Задание 1
res = input('Введите строку: ')
print('yes' if res == res[::-1] else 'no')

# Задание 2
result = input('Введите строку: ')
print(" ".join(result.split()))